Repository: hanifamar17/rateMyDay
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: id

source: Reset Password
id: Reset Kata Sandi

source: Enter your email and we'll send you a reset link
id: Masukkan emailmu, dan kami akan mengirimkan tautan reset.

source: Email Address
id: Alamat Email

source: you@example.com
id: emailmu@email.com

source: We'll send a password reset link to this email
id: Kami akan mengirimkan link reset kata sandi ke emal ini

source: Send Reset Link
id: Kirim Tautan Reset

source: Back to Login
id: Kembali ke Login

source: Please enter your email address
id: Masukkan alamat emailmu

source: Sign Up to RateJournee
id: Masuk ke RateJournee

source: Start your journey with us today!
id: Mulai perjalananmu bersama kami hari ini!

source: We'll never share your email with anyone else.
id: Kami tidak akan pernah membagikan email Anda kepada siapa pun.

source: Use at least 8 characters with letters and numbers
id: Gunakan minimal 8 karakter yang terdiri dari huruf dan angka.

source: Create Account
id: Buat Akun

source: Or continue with
id: Atau lanjutkan dengan

source: Sign Up with Google
id: Daftar dengan Google

source: Already have an account?
id: Sudah Punya Akun?

source: Login
id: Masuk

source: Track Your Daily Mood!
id: Lacak Mood Harianmu!

source: Discover Your Happiness Patterns!
id: Temukan Pola Kebahagiaanmu!

source: Reflect on your day with just one click. Rate your daily mood and add a short note to capture every precious moment.
id: Refleksikan harimu dengan satu klik. Beri rating untuk suasana hatimu hari ini dan tambahkan catatan singkat agar setiap momen berharga tetap terekam.

source: Log In to RateJournee
id: Masuk ke RateJournee

source: Password
id: Kata Sandi

source: Remember me
id: Ingat saya

source: Forgot your password?
id: Lupa kata sandi?

source: Sign In with Google
id: Masuk dengan Google

source: Don't have an account?
id: Belum punya akun?

source: Sign Up
id: Daftar

source: Features
id: Fitur-fitur

source: is a simple app to record and reflect on your day. With an intuitive interface, you can easily rate your day, add notes, and track your mood trends.
id: adalah aplikasi sederhana untuk mencatat dan merefleksikan hari Anda. Dengan antarmuka yang intuitif, Anda dapat dengan mudah memberikan rating, menambahkan catatan, dan melihat tren suasana hati Anda.

source: Record Your Day
id: Catat Harimu

source: Give your day a rating and add a quick note.
id: Beri rating dan tambahkan catatan singkat tentang hari Anda.

source: Track Your Progress
id: Lihat Perkembangan

source: Interactive charts to visualize your mood trends.
id: Grafik interaktif untuk melihat tren suasana hati Anda.

source: Quick & Easy
id: Cepat & Mudah

source: Takes just seconds to note down your day.
id: Cukup beberapa detik untuk mencatat hari Anda.

source: Start recording and reflecting on your days now!
id: Mulai catat dan refleksikan harimu sekarang juga!

source: Get Started
id: Mulai

source: More Emotionally Aware
id: Lebih Sadar Emosi

source: Recognize patterns and understand your feelings.
id: Melihat pola dan memahami perasaan Anda.

source: Build Positive Habits
id: Membangun Kebiasaan Positif

source: Identify good and bad patterns through daily journaling.
id: Kenali pola baik dan buruk lewat jurnal harianmu.

source: Express Yourself Freely
id: Bebas Ekspresikan Diri

source: Keep a personal journal as a reflection of your journey.
id: Simpan jurnal pribadi sebagai refleksi perjalanan hidupmu.

source: About Us
id: Tentang Kami

source: Hey there! We believe that every day has its own unique story. That’s why we created <strong>RateJournee</strong>—a simple platform to reflect on your day quickly and effortlessly.
id: Hai! Kami percaya bahwa setiap hari memiliki cerita uniknya sendiri. Itulah mengapa kami menciptakan <strong>RateJournee</strong>, platform sederhana untuk merefleksikan harimu dengan cepat dan mudah.

source: Each day is a canvas waiting to be filled with the colors of your experiences. Through reflection, we can recognize patterns, understand ourselves better, and find meaning in every moment. We hope <strong>RateJournee</strong> becomes a helpful tool in your journey, guiding you toward peace and happiness every day.
id: Setiap hari adalah kanvas yang menunggu untuk diisi dengan warna-warni pengalaman. Melalui refleksi, kita bisa melihat pola, memahami diri sendiri, dan menemukan makna dalam setiap momen. Kami berharap RateJournee bisa menjadi alat yang membantu dalam perjalanan refleksi ini, membimbing untuk menemukan kedamaian dan kebahagiaan di setiap hari.

source: Warm regards,
id: Salam hangat

source: RateJournee Team
id: Tim RateJournee

source: Support Us
id: Dukung Kami

source: Hey there! At RateJournee, we believe that tracking your mood daily can help you be more aware of your feelings, understand emotional patterns, and ultimately, have better days. We want to keep this platform free, simple, and useful for everyone.
id: Hai! Kami di RateJournee percaya bahwa mencatat suasana hati setiap hari bisa membantu kita lebih sadar dengan perasaan sendiri, memahami pola emosional, dan pada akhirnya, menjalani hari-hari dengan lebih baik. Kami ingin menjaga platform ini tetap gratis, simpel, dan bermanfaat untuk semua orang.

source: Why Your Support Matters?
id: Kenapa Dukunganmu Penting?

source: Even a little support from you helps us:
id: Dukungan kecil darimu bisa membantu kami:

source: Add awesome new features
id: Menambahkan fitur keren

source: like interactive charts, smarter mood insights, and an even smoother experience.
id: seperti grafik lebih interaktif, analisis suasana hati yang lebih cerdas, dan pengalaman pengguna yang lebih nyaman.

source: Keep your data safe & private
id: Menjaga privasi dan keamanan datamu

source: because we believe self-reflection should stay yours.
id: karena kami percaya refleksi pribadi harus tetap jadi milikmu.

source: Build a better mobile version
id: Mengembangkan versi mobile yang lebih nyaman

source: so you can record your mood anytime, anywhere.
id: supaya kamu bisa mencatat kapan saja, di mana saja.

source: Keep RateJournee free
id: Menjaga RateJournee tetap gratis

source: for everyone who needs a space to express themselves.
id: untuk siapa saja yang membutuhkan ruang untuk mengekspresikan diri.

source: Ways You Can Help
id: Cara Kamu Bisa Membantu

source: Share RateJournee
id: Bagikan RateJournee

source: Share with a friend or anyone who might find it helpful.
id: Bagikan ke teman atau siapa pun yang mungkin merasa ini bermanfaat.

source: Share now
id: Bagikan sekarang

source: Buy us a coffee
id: Belikan kami secangkir kopi

source: A small donation goes a long way!
id: Dengan donasi kecil – setiap dukungan berarti banget!

source: Donate now
id: Donasi Sekarang

source: Give feedback
id: Beri Masukan

source: What features would you love to see?
id: fitur apa yang ingin kamu lihat?

source: Send feedback
id: Kirim Masukan

source: We’d Love to Hear From You!
id: Kami ingin mendengar pendapatmu!

source: Help us improve by sharing your thoughts and ideas. Thank you for being part of this journey!
id: Bantu kami jadi lebih baik dengan berbagi pendapat dan idemu. Terima kasih sudah jadi bagian dari perjalanan ini!

source: Give Your Feedback
id: Beri Masukan

source: We appreciate your thoughts on how we can improve.
id: Kami menghargai setiap masukan untuk jadi lebih baik.

source: Name
id: Nama

source: Your name
id: Namamu

source: your@email.com
id: emailmu@email.com

source: Your Feedback
id: Masukanmu

source: Tell us what you think...
id: Ceritakan pendapatmu kepada kami…

source: Send Feedback
id: Kirim Masukan

source: Word Cloud
id: Word Cloud (Awan Kata)

source: Sentiment Analysis
id: Analisis Sentimen

source: Combined Word Cloud & Sentiment
id: Kombinasi Word Cloud & Sentimen

source: Mood Trend
id: Tren Mood

source: How to Read It?
id: bagaimana Cara Membacanya?

source: Why Use Moving Average Sentiment?
id: Mengapa Menggunakan Moving Average Sentiment?

source: How to Use This Feature
id: Cara Menggunakan Fitur Ini

source: Navigate to section
id: Navigasi ke bagian ini

source: Combined Insight
id: Kombinasi Word Cloud & Sentimen

source: About Journal Analytics
id: Tentang Jurnal Analitik

source: Understand how Journal Analytics help you reflect and grow through your journaling.
id: Pahami bagaimana Jurnal Analitik membantu Anda untuk refleksi dan berkembang melalui jurnal Anda

source: A Word Cloud is a visual display of the most meaningful words from your journal. Unlike basic frequency-based clouds, this version uses <strong>TF-IDF</strong> (Term Frequency–Inverse Document Frequency), which highlights unique and relevant words, not just the most repeated ones.
id: Word Cloud adalah tampilan visual dari kata-kata yang paling bermakna dalam jurnal Anda. Berbeda dengan cloud dasar yang hanya didasarkan pada frekuensi, versi ini menggunakan <strong>TF-IDF</strong> (Term Frequency–Inverse Document Frequency), yang menyoroti kata-kata yang unik dan relevan, bukan hanya yang paling sering diulang.

source: <strong>Bigger words:</strong> More meaningful in context
id: <strong>Kata besar:</strong> Kata penting atau sering muncul secara bermakna

source: <strong>Position:</strong> Random; doesn't reflect order or importance
id: <strong>Posisi:</strong> Acak, tidak menunjukkan urutan tertentu

source: <strong>Colors:</strong> Used for style or emotional grouping
id: <strong>Warna:</strong> Estetika atau menunjukkan emosi/tema tertentu

source: <strong>Tip:</strong> Use the word cloud to identify recurring themes and reflect on what truly matters to you.
id: <strong>Tip:</strong> Gunakan word cloud untuk mengidentifikasi tema-tema yang berulang dan merenungkan apa yang benar-benar penting bagi Anda.

source: Sentiment Analysis determines whether your journal entries are overall <strong>positive</strong>, <strong>neutral</strong>, or <strong>negative</strong>. It analyzes your words and phrases in context and assigns a sentiment score.
id: Analisis Sentimen menentukan apakah entri jurnal Anda secara keseluruhan bersifat <strong>positif</strong>, <strong>netral</strong>, atau <strong>negatif</strong>. Ini menganalisis kata-kata dan frasa Anda dalam konteks dan memberikan skor sentimen.

source: <strong>Score:</strong> Numeric (e.g., -1.0 to +1.0)
id: <strong>Skor:</strong> misalnya dari -1.0 hingga +1.0

source: <strong>Label:</strong> Positive, Neutral, or Negative
id: <strong>Label:</strong> Positif, Netral, Negatif

source: <strong>Visualization:</strong> Chart or word cloud
id: <strong>Visualisasi:</strong> Grafik atau word cloud</strong>

source: <strong>Use Case:</strong> Identify mood patterns, emotional triggers, and track your personal growth.
id: <strong>Kasus Penggunaan:</strong> Identifikasi pola mood, pemicu emosi, dan pantau pertumbuhan pribadi Anda.

source: Combining Word Cloud & Sentiment
id: Kombinasi Word Cloud & Sentimen

source: By combining Word Cloud and Sentiment Analysis, you can discover which words are associated with different moods, and how your language shifts as your emotions change.
id: Dengan menggabungkan Word Cloud dan Analisis Sentimen, Anda dapat menemukan kata-kata yang terkait dengan berbagai mood, serta bagaimana bahasa Anda berubah seiring dengan perasaan Anda.

source: This provides a deeper understanding of your thoughts and feelings, helping you reflect more effectively.
id: Hal ini memberikan pemahaman yang lebih dalam tentang pikiran dan perasaan Anda, membantu Anda untuk merefleksikan diri dengan lebih efektif.

source: Mood Trend shows the pattern of how your mood changes over time. This graph is calculated using the concept of Moving Average Sentiment to provide a more stable and easy-to-understand emotional overview. Moving Average Sentiment is a feature that helps you understand the emotional trends in your journal over a specific period of time. It visually summarizes your positive, negative, or neutral moods in a clear and easy-to-read format. A moving average calculates the average of your sentiment scores over a given time window — for example, a 7-day moving average will show your sentiment trend across the past week.
id: Tren Mood menampilkan pola perubahan suasana hati Anda dari waktu ke waktu. Grafik ini dihitung menggunakan konsep Moving Average Sentiment untuk memberikan gambaran emosi yang lebih stabil dan mudah dipahami. Moving Average Sentiment adalah fitur yang membantu Anda memahami tren emosional dalam jurnal Anda selama periode waktu tertentu. Fitur ini merangkum suasana hati Anda yang positif, negatif, atau netral secara visual dalam format yang jelas dan mudah dibaca. Moving average menghitung rata-rata skor sentimen Anda dalam rentang waktu tertentu — misalnya, moving average 7 hari akan menunjukkan tren suasana hati Anda selama seminggu terakhir.

source: <strong>Upward trend</strong>: Indicates your mood is improving over time
id: <strong>Garis naik:</strong> Menunjukkan tren sentimen positif yang meningkat

source: <strong>Downward trend</strong>: Suggests a decline in emotional state
id: <strong>Garus turun:</strong> Menunjukkan tren sentimen yang menurun

source: <strong>Flat line</strong>: Reflects emotional stability or consistency
id: <strong>Garis datar:</strong> Menunjukkan sentimen yang stabil atau konsisten

source: <strong>Spot long-term patterns</strong>: Identify emotional trends that may not be visible in daily entries
id: <strong>Melihat pola jangka panjang:</strong> Membantu Anda mengenali tren emosi yang mungkin tidak terlihat pada entri harian tunggal

source: <strong>Deeper self-reflection</strong>: Gain a bigger picture of your mental health over time
id: <strong>Refleksi lebih mendalam:</strong> Memberikan gambaran kesehatan mental Anda dari waktu ke waktu

source: <strong>Recognize emotional triggers</strong>: Understand specific events or time periods that affect your mood
id: <strong>Memahami pemicu emosional:</strong> Membantu mengidentifikasi kejadian atau periode yang memengaruhi suasana hati Anda

source: Go to the <strong>Journal Analytics</strong> section in your journal app
id: Buka bagian <strong>Jurnal Analitik</strong> pada aplikasi jurnal Anda

source: Select the time period you want to review (e.g., 7 days, 30 days)
id: Pilih periode waktu yang ingin Anda analisis (7 hari, 30 hari, dll.)

source: Observe the sentiment trend line shown in the chart
id: Perhatikan garis tren sentimen yang ditampilkan

source: Reflect on the emotional changes and connect them with events in your life
id: Refleksikan perubahan yang terjadi dan hubungkan dengan kejadian dalam hidup Anda

source: <strong>Use Case:</strong> Insight your rhythms and better understand your well-being as it evolves over time.
id: <strong>Kasus Penggunaan:</strong> Pahami ritme emosional Anda dan kenali lebih baik kondisi emosional diri seiring waktu.

source: These tools are designed to support self-reflection and are not a substitute for professional advice.
id: Alat-alat ini dirancang untuk membantumu memahami diri sendiri dengan lebih baik, namun bukan pengganti saran dari tenaga profesional.

source: Dashboard
id: Dasbor

source: Welcome to your personal mood tracking space
id: Selamat datang di ruang pelacak mood kamu

source: Daily Mood
id: Beri rating mood kamu dan tulis jurnal harian

source: Get started
id: Mulai

source: My Journal
id: Jurnalku

source: View history of your mood ratings and journal entries
id: Lihat riwayat rating mood dan entri jurnal kamu

source: View journal
id: Lihat jurnal

source: Journal Analytics
id: Jurnal Analitik

source: Analyze patterns and insights from your journal entries
id: Analisis pola dan insight dari jurnal kamu

source: See insights
id: Lihat insight

source: Recent Activity
id: Aktivitas Terbaru

source: View all
id: Lihat semua

source: No recent journal entries yet
id: Belum ada entri jurnal terbaru

source: Create your first entry
id: Buat entri pertamamu

source: Stats Summary
id: Ringkasan Statistik

source: Total Entries
id: Total entri

source: Total journal entries recorded
id: Total jurnal entri yang dicatat

source: Start journaling to see stats
id: Mulai membuat jurnal untuk melihat statistik

source: Average Mood
id: Rata-rata Mood

source: Based on your mood entries
id: Berdasarkan entri mood kamu

source: Rate your mood to see average
id: Beri rating mood kamu untuk melihat rata-rata

source: Average Mood Trend
id: Rata-rata Tren Mood

source: Based on all your journal sentiment
id: Berdasarkan semua sentimen jurnalmu

source: Write journals to see average mood trend
id: Tulis jurnal untuk melihat rata-rata tren mood

source: Track Your Day with Charts!
id: Lacak Harimu dengan Grafik!

source: View your daily ratings in bar and line charts.
id: Lihat rating harianmu dalam grafik batang dan garis.

source: Show chart for:
id: Tampilkan grafik untuk:

source: Range Date
id: Rentang Tanggal

source: 1 Week
id: 1 Minggu

source: 2 Weeks
id: 2 Minggu

source: 1 Month
id: 1 Bulan

source: Pick a Month
id: Pilih Bulan

source: How's Your Day?
id: Gimana Harimu?

source: Take a moment to reflect on your day
id: Luangkan waktu sebentar untuk refleksi harimu.

source: Date
id: Tanggal

source: Pick a date, or I'll default to today!
id: Pilih tanggal, atau aku bakal otomatis pilih hari ini!

source: Mood Rating
id: Rating Mood

source: How are you feeling today?
id: Gimana perasaanmu hari ini?

source: Awful
id: Buruk

source: Excellent
id: Luar Biasa

source: Journal Entry
id: Catatan Jurnal

source: Create your card. Express your thoughts and feelings...
id: Buat kartu harianmu. Ungkapkan pikiran dan perasaanmu...

source: Submit Rating
id: Kirim Rating

source: Hey, this looks familiar!
id: Eh, sepertinya ini sudah pernah ada!

source: We already have this entry in our records. Would you like to update it?
id: Kami sudah punya data ini sebelumnya. Mau diperbarui aja?

source: Yes, update it
id: Ya, perbarui

source: Nevermind
id: Gak jadi

source: All updated! Your changes have been saved.
id: Sudah diperbarui! Perubahanmu berhasil disimpan.

source: Great job! Your data has been saved successfully.
id: Keren! Datamu berhasil disimpan.

source: Oops! Something went wrong. Give it another try?
id: Ups! Ada yang salah nih. Coba lagi, ya?

source: Journal Archive
id: Catatan Jurnal

source: Explore your past journal entries!
id: Jelajahi catatan jurnalmu yang lalu!

source: Today
id: Hari ini

source: Sun
id: Min

source: Mon
id: Sen

source: Tue
id: Sel

source: Wed
id: Rab

source: Thu
id: Kam

source: Fri
id: Jum

source: Sat
id: Sab

source: Check your journal & edit anytime!
id: Cek jurnalmu & edit kapan saja!

source: Save
id: Simpan

source: Delete
id: Hapus

source: Open Card
id: Buka Kartu

source: Share
id: Bagikan

source: Copy
id: Salin

source: Download
id: Unduh

source: Day of Week
id: Hari

source: Mood Rating
id: Rating Mood

source: Journal Entry
id: Catatan Jurnal

source: Add Journal
id: Tambah Jurnal

source: Are you sure?
id: Yakin ingin menghapus?

source: Deleted journal entries can't be recovered!
id: Catatan jurnal yang dihapus tidak bisa dikembalikan!

source: Delete it!
id: Ya, hapus

source: Cancel
id: Batal

source: Journal deleted successfully!
id: Catatan jurnal berhasil dihapus.

source: Error deleting journal
id: Gagal menghapus jurnal

source: Visualize patterns and trends in your journal entries
id: Lihat pola dan tren yang muncul dari catatan jurnal Anda.

source: Word Clouds
id: Word Cloud

source: Mood Trends
id: Tren Mood

source: Displays the most important words in your journal entries
id: Menampilkan kata-kata paling penting dari entri jurnal Anda

source: How your feelings change over time
id: Bagaimana perasaanmu berubah dari waktu ke waktu

source: No journal entries found for this period.
id: Belum ada entri jurnal untuk periode ini

source: Try selecting a different time range or start journaling to see word cloud.
id: Coba pilih rentang waktu lain atau mulai menulis jurnal untuk melihat word cloud.

source: About Word Clouds
id: Tentang Word Cloud

source: Word clouds show the most important words in your journal entries, with larger words meaning they appear more often or are more important. This helps you spot common themes and ideas in your writing. You can create word clouds that focus on specific feelings, such as positive, neutral, or negative moods, or you can filter them by a time range, like the past month or year. This gives you a better understanding of how your thoughts and feelings change over time.
id: Word Cloud menampilkan kata-kata paling bermakna dari entri jurnalmu. Semakin besar ukuran kata, artinya kata tersebut lebih sering muncul atau memiliki arti yang lebih penting. Fitur ini membantumu mengenali tema atau gagasan yang sering muncul dalam tulisanmu. Kamu juga bisa membuat Word Cloud berdasarkan suasana hati tertentu—seperti positif, netral, atau negatif—atau memfilter berdasarkan rentang waktu, seperti sebulan terakhir atau setahun terakhir. Dengan begitu, kamu bisa lebih memahami bagaimana pikiran dan perasaanmu berubah seiring waktu.

source: Learn more about journal analytics
id: Pelajari lebih tentang jurnal analitik

source: Write in your journal
id: Tulis di jurnalmu

source: Time Period
id: Rentang Waktu

source: Last Month
id: Bulan Lalu

source: Last Year
id: Tahun Lalu

source: All Time
id: Sepanjang Waktu

source: Sentiment
id: Sentimen

source: All Sentiments
id: Semua Sentimen

source: Positive
id: Positif

source: Neutral
id: Netral

source: Negative
id: Negatif

source: Apply
id: Terapkan

source: 7 Days
id: 7 Hari

source: 30 Days
id: 30 Hari

source: All
id: Semua

source: This chart shows the emotional trend of your journal entries. The higher the point, the more positive your emotion.
id: Grafik ini menunjukkan tren emosi dari catatan harianmu. Semakin ke atas berarti emosimu semakin positif.

source: Tip: Tap on a point in the chart to view the journal entry for that date.
id: Tip: Ketuk pada titik di grafik untuk melihat entri jurnal pada tanggal tersebut.

source: No data to display yet
id: Belum ada data untuk ditampilkan.

source: Mood Average:
id: Rata-rata Mood:

source: Actual Sentiment
id: Sentimen Aktual

source: Actual Mood:
id: Mood Aktual:

source: Very Positive
id: Sangat Positif

source: Very Negative
id: Sangat Negatif

source: Your mood has been relatively stable
id: Mood kamu relatif stabil

source: Your mood is showing a positive trend!
id: Mood kamu menunjukkan tren positif!

source: Your mood has been declining lately
id: Mood kamu cenderung menurun akhir-akhir ini

source: Good Morning
id: Selamat Pagi

source: Good Afternoon
id: Selamat Siang

source: Good Evening
id: Selamat Malam

source: Hi
id: Hai

source: Home
id: Beranda

source: Logout
id: Keluar

source: All rights reserved.
id: Hak cipta dilindungi.

source: Navigation
id: Navigasi

source: Support Us
id: Dukung Kami

source: Help & Support
id: Bantuan & Dukungan

source: How to Use
id: Cara Penggunaan

source: Privacy Policy
id: Kebijakan Privasi

source: FAQs
id: FAQ

source: Journal Analytics
id: Jurnal Analitik

source: Contact Info
id: Info Kontak

source: Social Media
id: Media Sosial

source: English
id: Inggris

source: Support Us
id: Dukung Kami
